{
    "version": "https://jsonfeed.org/version/1",
    "title": "Mike Hacker | Microsoft Azure Application Innovation Specialist",
    "description": "",
    "home_page_url": "https://blog.mikehacker.net",
    "feed_url": "https://blog.mikehacker.net/feed.json",
    "user_comment": "",
    "author": {
        "name": "Mike Hacker"
    },
    "items": [
        {
            "id": "https://blog.mikehacker.net/how-to-choose-between-azure-kubernetes-service-or-azure-red-hat-openshift/",
            "url": "https://blog.mikehacker.net/how-to-choose-between-azure-kubernetes-service-or-azure-red-hat-openshift/",
            "title": "How to choose between Azure Kubernetes Service or Azure Red Hat OpenShift",
            "summary": "Note: Portions of this blog post were written using Bing Chat. Azure Kubernetes Service (AKS) and Azure Red Hat OpenShift&hellip;",
            "content_html": "<blockquote>\n<p><em>Note: Portions of this blog post were written using Bing Chat.</em></p>\n</blockquote>\n<p>Azure Kubernetes Service (AKS) and Azure Red Hat OpenShift (ARO) are two options for deploying and managing containerized applications on Azure. Both services are based on Kubernetes, the open-source platform for orchestrating containers, but they have some differences and trade-offs that you should consider before choosing one over the other.</p>\n<p>AKS is a fully managed Kubernetes service that offers serverless Kubernetes, an integrated continuous integration and continuous delivery (CI/CD) experience, and enterprise-grade security and governance. AKS is optimized for running general purpose containers, especially for applications that span many microservices deployed in containers. AKS supports Kubernetes-style apps and microservices with features like service discovery and traffic splitting. AKS also enables event-driven application architectures by supporting scale based on traffic and pulling from event sources like queues, including scale to zero. AKS does not provide direct access to the underlying Kubernetes control plane, which means you have less control and customization options over your cluster.</p>\n<p>ARO is a fully managed OpenShift service that provides a consistent hybrid cloud foundation for building and scaling containerized applications. OpenShift is a distribution of Kubernetes that adds additional features and integrations to enhance the developer experience and enterprise readiness of Kubernetes. OpenShift provides a web console, an integrated image registry, a built-in CI/CD pipeline, a source-to-image tool, a service catalog, and many other tools to help developers build, deploy, and manage applications. OpenShift also offers more security features than AKS, such as role-based access control, security context constraints, network policies, and encryption. ARO provides direct access to the underlying Kubernetes APIs and control plane, which gives you more flexibility and customization options over your cluster.</p>\n<p>The pros and cons of each service depend on your specific use case and requirements. Some general considerations are:</p>\n<p>- If you want a fully managed Kubernetes experience with minimal configuration and maintenance, AKS may be a good choice.</p>\n<p>- If you want a more comprehensive platform that includes additional tools and integrations for developing and deploying containerized applications, ARO may be a better option.</p>\n<p>- If you need direct access to the Kubernetes control plane, or if you want to use OpenShift-specific features or extensions, ARO is the only option.</p>\n<p>- If you need to scale your applications based on events or traffic, or if you want to leverage serverless containers, AKS has more support for these scenarios than ARO.</p>\n<p>- If you are concerned about security and compliance, ARO may offer more features and capabilities than AKS to meet your needs.</p>\n<p>Ultimately, the best way to choose between AKS and ARO is to try them out for yourself and see which one suits your needs better. You can get started with AKS using the quickstarts or with ARO using the tutorials.</p>",
            "image": "https://blog.mikehacker.net/media/posts/70/OIG.jpg",
            "author": {
                "name": "Mike Hacker"
            },
            "tags": [
                   "Articles"
            ],
            "date_published": "2023-04-21T14:25:17-04:00",
            "date_modified": "2023-04-21T14:41:49-04:00"
        },
        {
            "id": "https://blog.mikehacker.net/microsoft-build-or-may-23-24-2023/",
            "url": "https://blog.mikehacker.net/microsoft-build-or-may-23-24-2023/",
            "title": "Microsoft Build | May 23-24, 2023",
            "summary": "Are you a developer or tech enthusiast looking to stay ahead of the curve? Then don't miss out on the&hellip;",
            "content_html": "<p>Are you a developer or tech enthusiast looking to stay ahead of the curve? Then don't miss out on the opportunity to attend Microsoft Build on May 23-24! This annual conference is packed with informative sessions and hands-on workshops led by industry experts. You'll have the chance to learn about the latest technologies and trends in software development and connect with other professionals in your field.</p>\n<p>Don't wait - <a href=\"https://build.microsoft.com/en-US/home\">register now</a> and join us for an unforgettable experience!</p>",
            "image": "https://blog.mikehacker.net/media/posts/69/8659ae4d-4633-4d2d-aeca-88e1b6f3e31a.png",
            "author": {
                "name": "Mike Hacker"
            },
            "tags": [
                   "Events"
            ],
            "date_published": "2023-03-15T09:31:51-04:00",
            "date_modified": "2023-03-15T09:35:18-04:00"
        },
        {
            "id": "https://blog.mikehacker.net/architecture-pattern-reliable-web-app/",
            "url": "https://blog.mikehacker.net/architecture-pattern-reliable-web-app/",
            "title": "Architecture Pattern: Reliable Web App",
            "summary": "The reliable web app pattern is a set of best practices built on the Azure Well-Architected Framework that helps developers successfully migrate&hellip;",
            "content_html": "<p>The reliable web app pattern is a set of best practices built on the <a href=\"https://learn.microsoft.com/en-us/azure/architecture/framework/\" data-linktype=\"absolute-path\">Azure Well-Architected Framework</a> that helps developers successfully migrate web applications to the cloud. The goal is to improve the cost, performance, security, operations, and reliability of your web application with minimal changes. The reliable web app pattern is an essential first step for web applications converging on the cloud and sets a foundation for future modernizations in Azure.</p>\n<p>Check out the details for the <a href=\"https://learn.microsoft.com/en-us/azure/architecture/reference-architectures/reliable-web-app/dotnet/pattern-overview\" target=\"_blank\" rel=\"noopener noreferrer\">Reliable Web App pattern</a> and see how you can <a href=\"https://learn.microsoft.com/en-us/azure/architecture/reference-architectures/reliable-web-app/dotnet/apply-pattern\" target=\"_blank\" rel=\"noopener noreferrer\">apply the pattern with best practices</a>.</p>\n<p>Looking to build new applications or modernize existing applications, reach out to your Microsoft account team to see how they can help!</p>",
            "image": "https://blog.mikehacker.net/media/posts/68/reliable-web-app-dotnet.png",
            "author": {
                "name": "Mike Hacker"
            },
            "tags": [
                   "How To",
                   "Articles"
            ],
            "date_published": "2023-02-28T14:35:56-05:00",
            "date_modified": "2023-02-28T14:35:56-05:00"
        },
        {
            "id": "https://blog.mikehacker.net/webinar-or-simplify-and-scale-enterprise-spring-apps-in-the-cloud/",
            "url": "https://blog.mikehacker.net/webinar-or-simplify-and-scale-enterprise-spring-apps-in-the-cloud/",
            "title": "Webinar | Simplify and Scale Enterprise Spring Apps in the Cloud",
            "summary": "March 23, 2023 | 7 AM - 8:30 AM PST or 4 PM to 5:30 PM PST Zero Management. Maximum&hellip;",
            "content_html": "<p>March 23, 2023 | 7 AM - 8:30 AM PST or 4 PM to 5:30 PM PST</p>\n<p><strong>Zero Management. Maximum Productivity.</strong></p>\n<p><strong>Struggling to quickly develop and deploy Java or polyglot apps? Bogged down with implementation challenges and management effort?</strong></p>\n<p>If you're an application developer, architect, or platform engineer looking to build and scale enterprise-ready apps in the cloud, Azure Spring Apps Enterprise is a fully managed service that can help you reach your goals sooner − all while minimizing busywork and maximizing security with Azure. Want to learn more?</p>\n<p>Join an interactive virtual session where we will show the value Azure Spring Apps Enterprise can bring to your organization. We will cover the following topics:</p>\n<ul>\n<li>Ideal use cases for Azure Spring Apps Enterprise </li>\n<li>How to streamline deployment, scaling, patching and resilience for your apps</li>\n<li>How to simplify cloud-native app architecture with Azure Spring Apps Enterprise, including security, request routing, configuration, discovery, and more</li>\n<li>How Azure Spring Apps simplifies DevSecOps for polyglot applications</li>\n</ul>",
            "image": "https://blog.mikehacker.net/media/posts/67/marketo-banner-dark.svg",
            "author": {
                "name": "Mike Hacker"
            },
            "tags": [
                   "Events"
            ],
            "date_published": "2023-02-27T11:48:34-05:00",
            "date_modified": "2023-02-27T11:48:34-05:00"
        },
        {
            "id": "https://blog.mikehacker.net/upcoming-events-on-kubernetes-and-cloud-native/",
            "url": "https://blog.mikehacker.net/upcoming-events-on-kubernetes-and-cloud-native/",
            "title": "Upcoming Events on Kubernetes and Cloud Native",
            "summary": "Microsoft partner, Atmosera, will be delivering two free webinars in February related to cloud native development and Azure Kubernetes Service.",
            "content_html": "<p>Microsoft partner, Atmosera, will be delivering two free webinars in February related to cloud native development and Azure Kubernetes Service.  Click on the links below for additional details and registration.</p>\n<p><strong>Event: Cloud Native Development + GitHub</strong><br>March 28, 2023 from 8 AM - Noon PST<br><a href=\"https://info.atmosera.com/cloud-native-development-github\" target=\"_blank\" rel=\"noopener noreferrer\">Learn more and register</a><br><br><strong>Event: Containerization with Azure (AKS + Container Apps)</strong><br>February 21, 2023 from 8 AM - Noon PST<br><a href=\"https://info.atmosera.com/containerization-with-azure-aks-container-apps\" target=\"_blank\" rel=\"noopener noreferrer\">Learn more and register</a></p>",
            "image": "https://blog.mikehacker.net/media/posts/66/atmoseraevent-xxl.png",
            "author": {
                "name": "Mike Hacker"
            },
            "tags": [
                   "Events"
            ],
            "date_published": "2023-02-08T10:47:33-05:00",
            "date_modified": "2023-02-17T11:19:40-05:00"
        },
        {
            "id": "https://blog.mikehacker.net/winter-tech-briefing-or-columbus-ohio/",
            "url": "https://blog.mikehacker.net/winter-tech-briefing-or-columbus-ohio/",
            "title": "Winter Tech Briefing | Columbus Ohio",
            "summary": "Join Microsoft, Citrix, Dell, Slalom CGI, Improving, MAVEN and Planet Technologies for a Winter Tech Briefing in Columbus, Ohio on&hellip;",
            "content_html": "<p>Join Microsoft, Citrix, Dell, Slalom CGI, Improving, MAVEN and Planet Technologies for a Winter Tech Briefing in Columbus, Ohio on March 15 and 16, 2023.</p>\n<p>During this in-person tech briefing you can attend sessions on:</p>\n<ul>\n<li>Machine Learning</li>\n<li>Azure Pipelines</li>\n<li>Sentinel</li>\n<li>Azure Design Patterns</li>\n<li>Intune</li>\n<li>Evolving Journey for Cloud Architects</li>\n<li>Zero Trust Architecture</li>\n<li>FinOps</li>\n<li>Microservices,</li>\n<li>Trench Warefare</li>\n<li>Microsoft Teams</li>\n<li>Citrix VDI</li>\n<li>M365 Compliance</li>\n</ul>\n<p><a href=\"https://www.eventbrite.com/e/central-ohio-winter-tech-briefings-tickets-525779961017\">Learn more and register</a> before the event fills up!</p>",
            "image": "https://blog.mikehacker.net/media/posts/65/https___cdn.evbuc.com_images_433792799_109757458479_1_original.webp",
            "author": {
                "name": "Mike Hacker"
            },
            "tags": [
                   "Events"
            ],
            "date_published": "2023-02-01T09:37:31-05:00",
            "date_modified": "2023-03-15T09:35:23-04:00"
        },
        {
            "id": "https://blog.mikehacker.net/upcoming-ipaas-and-github-events/",
            "url": "https://blog.mikehacker.net/upcoming-ipaas-and-github-events/",
            "title": "Upcoming iPaaS &amp; GitHub Events",
            "summary": "Microsoft partner, Atmosera, will be hosting 2 free webinars early in February covering topics such as iPaaS, GitHub and Cloud&hellip;",
            "content_html": "<p>Microsoft partner, Atmosera, will be hosting 2 free webinars early in February covering topics such as iPaaS, GitHub and Cloud Native solutions.  See below for details and registration link.</p>\n<p><strong>Modern Integration Platform as a Service (iPaaS) Architecture + GitHub<br></strong>February 2, 2023 from 8am to 12pm PST<br><a href=\"https://info.atmosera.com/modern-integration-ipaas-github\">Modern Integration Platform-as-a-Service (iPaaS) Architecture + GitHub (atmosera.com)</a></p>\n<p><strong>GitHub + Cloud Native + light iPaaS<br></strong>February 8, 2023 from 9am to 4:30pm PST<br><a href=\"https://info.atmosera.com/github-cloudnative-light-paas-1\">GitHub + Cloud Native + light iPaaS (atmosera.com)</a></p>",
            "image": "https://blog.mikehacker.net/media/posts/64/atmoseraevent.png",
            "author": {
                "name": "Mike Hacker"
            },
            "tags": [
                   "Events"
            ],
            "date_published": "2023-01-24T12:35:29-05:00",
            "date_modified": "2023-01-24T12:35:29-05:00"
        },
        {
            "id": "https://blog.mikehacker.net/free-azure-virtual-training-day-fundamentals/",
            "url": "https://blog.mikehacker.net/free-azure-virtual-training-day-fundamentals/",
            "title": "Free Azure Virtual Training Day: Fundamentals",
            "summary": "Monday, January 30, 2023 | 9:00 AM - 11:15 AM | (GMT-08:00) Pacific Time (US &amp; Canada) Tuesday, January 31,&hellip;",
            "content_html": "<blockquote>\n<p>Monday, January 30, 2023 | 9:00 AM - 11:15 AM | (GMT-08:00) Pacific Time (US &amp; Canada)<br>Tuesday, January 31, 2023 | 9:00 AM - 11:30 AM | (GMT-08:00) Pacific Time (US &amp; Canada</p>\n</blockquote>\n<p>Join us at Microsoft Azure Virtual Training Day: Fundamentals for an introduction to cloud computing concepts, models, and services—from public to private to hybrid cloud. You’ll also learn the basics of infrastructure as a service (IaaS), platform as a service (PaaS), and software as a service (SaaS). Prepare to take full advantage of the key Azure pillars of security, privacy, compliance, and trust.</p>\n<p>Who should attend:</p>\n<ul>\n<li>Developers</li>\n<li>Architects</li>\n<li>IT professionals</li>\n<li>Cloud novices</li>\n</ul>\n<p>Technical level: For those who are just beginning to work with cloud-based solutions and services or are new to Azure.</p>\n<p>After completing this training, you will be able to:</p>\n<ul>\n<li>Prepare for cloud migration with the training to evaluate your existing on-premises environment.</li>\n<li>Optimize your Azure-based workloads for maximum ROI.</li>\n<li>Learn best practices for managing your virtual machines, applications, and data with Azure.</li>\n<li>Take the <a href=\"https://docs.microsoft.com/learn/certifications/azure-fundamentals/\" target=\"_blank\" alt=\"Click to learn more about the Azure Fundamentals certification exam.\" rel=\"noopener\">Microsoft Azure Fundamentals certification exam</a> at no cost.</li>\n</ul>\n<p><a href=\"https://mktoevents.com/Microsoft+Event/377897/157-GQE-382\">Learn more and register here</a></p>",
            "image": "https://blog.mikehacker.net/media/posts/63/fundamentals.png",
            "author": {
                "name": "Mike Hacker"
            },
            "tags": [
                   "Events"
            ],
            "date_published": "2023-01-10T09:40:18-05:00",
            "date_modified": "2023-02-01T09:38:13-05:00"
        },
        {
            "id": "https://blog.mikehacker.net/benefits-of-low-code-for-app-dev/",
            "url": "https://blog.mikehacker.net/benefits-of-low-code-for-app-dev/",
            "title": "Benefits of Low Code for App Dev",
            "summary": "In today's fast-paced business environment, organizations are under constant pressure to deliver value to customers quickly and efficiently. One way&hellip;",
            "content_html": "<p>In today's fast-paced business environment, organizations are under constant pressure to deliver value to customers quickly and efficiently. One way to meet this challenge is by using low code solutions such as <a href=\"https://powerapps.microsoft.com/en-us/\" target=\"_blank\" rel=\"noopener noreferrer\">Microsoft Power Apps</a> to build and deploy applications.</p>\n<p>Low code solutions allow non-technical users to create custom applications by dragging and dropping pre-built components, rather than writing code from scratch. This can save a significant amount of time and effort, and can make it easier for organizations to build and deploy applications quickly.</p>\n<p>There are several benefits to using low code solutions:</p>\n<ul>\n<li>\n<p>Speed and agility: Low code solutions can help organizations build and deploy applications faster, as they do not require the same level of technical expertise or coding knowledge. This can help organizations respond more quickly to changing business needs and deliver value to customers more rapidly.</p>\n</li>\n<li>\n<p>Increased productivity: Low code solutions can also increase productivity by empowering non-technical users to build and customize applications themselves, rather than relying on IT or professional developers. This can reduce the workload for IT and developers, allowing them to focus on more strategic tasks.</p>\n</li>\n<li>\n<p>Cost savings: Low code solutions can also help organizations save money by reducing the need for specialized skills and resources. Non-technical users can build and maintain applications themselves, which can lower the costs of development and maintenance.</p>\n</li>\n</ul>\n<p>Some professional developers may be hesitant to adopt low code solutions due to concerns about the quality or flexibility of the resulting applications. However, low code solutions have come a long way in recent years, and can now support a wide range of capabilities and customization options. Additionally, professional developers and low code developers can work together to ensure that the resulting applications meet the necessary standards and requirements. For example, professional developers can build APIs that low code developers can use, which can help to extend the capabilities of the application and improve its integration with other systems.</p>\n<p>Low code solutions can be a valuable tool for organizations looking to build and deploy applications quickly and efficiently. By leveraging the benefits of low code and working together with professional developers, organizations can deliver value to customers faster and respond more effectively to changing business needs.</p>",
            "image": "https://blog.mikehacker.net/media/posts/62/covid_hero_desktop.jpg",
            "author": {
                "name": "Mike Hacker"
            },
            "tags": [
                   "Articles"
            ],
            "date_published": "2023-01-05T11:19:05-05:00",
            "date_modified": "2023-01-05T11:19:05-05:00"
        },
        {
            "id": "https://blog.mikehacker.net/modernization-is-expensive/",
            "url": "https://blog.mikehacker.net/modernization-is-expensive/",
            "title": "Modernization is Expensive",
            "summary": "One common theme I hear when speaking with customers about Application Modernization is that they don't have the budget or&hellip;",
            "content_html": "<p>One common theme I hear when speaking with customers about Application Modernization is that they don't have the budget or that they can't dedicate the necessary resources to complete a modernization project.  It is true that Application Modernization will have a cost and that it will require dedicated resources.  But, does it really make sense to not invest in modernization and instead continue on legacy applications?</p>\n<p>It is important to look at the bigger picture and identify the potential risks and costs of not doing anything.  Specifically:</p>\n<ul>\n<li>\n<p>Security risks: Legacy applications may be more vulnerable to security threats such as hackers, malware, and data breaches, due to their outdated technology and lack of support. Modernization can help address these security risks by updating the application with the latest security protocols and patches, as well as incorporating features such as encryption and authentication.</p>\n</li>\n<li>\n<p>Compliance risks: Government agencies may also face compliance risks if they continue to use legacy applications that do not meet current regulations or standards. Modernization can help ensure that the application is compliant with relevant laws, policies, and industry standards, which can help prevent costly fines, legal issues, and reputational damage.</p>\n</li>\n<li>\n<p>Cost of maintenance and support: Continuing to support and maintain a legacy application can also be costly, as it may require specialized skills and resources that may not be readily available. Modernization can help reduce these costs by simplifying the application, improving its maintainability, and leveraging the latest tools and technologies.</p>\n</li>\n</ul>\n<p>Modernizing an application can also help reduce technical debt by addressing the underlying issues that contribute to technical debt in the first place. Technical debt is the cost that an organization incurs when it takes shortcuts or makes trade-offs that compromise the long-term quality or maintainability of its systems. This can happen for a variety of reasons, such as a lack of resources, time, or skills, or a need to meet short-term goals.</p>\n<p>Over time, technical debt can accumulate and become a significant burden on an organization, as it can lead to a number of problems, including:</p>\n<ul>\n<li>\n<p>Reduced performance: Technical debt can slow down the performance of an application, as it may require more resources and processing power to run. This can lead to a poor user experience, as well as increased costs for infrastructure and support.</p>\n</li>\n<li>\n<p>Increased maintenance costs: Technical debt can also make an application more difficult and costly to maintain, as it may require specialized skills or resources to fix or update. This can lead to increased maintenance costs and a higher risk of failure or downtime.</p>\n</li>\n<li>\n<p>Reduced flexibility and agility: Technical debt can also limit an organization's ability to respond to changing business needs or take advantage of new opportunities. It may be difficult or costly to make changes or updates to an application with high levels of technical debt, which can limit the organization's flexibility and agility.</p>\n</li>\n</ul>\n<p>By modernizing an application, an organization can address the underlying issues that contribute to technical debt and reduce the costs and risks associated with it. Modernization can involve a variety of activities, such as updating the technology stack, refactoring the code, improving the architecture, and introducing best practices and standards. By taking these steps, an organization can improve the performance, maintainability, and agility of its applications, and reduce its technical debt.</p>\n<p>Overall, modernization may be a necessary investment for a government agency to address the risks and costs associated with legacy applications. By carefully evaluating the potential benefits and costs, and developing a clear roadmap and plan for modernization, the agency can make informed decisions about whether and how to modernize their legacy applications.</p>",
            "image": "https://blog.mikehacker.net/media/posts/61/cost.jpg",
            "author": {
                "name": "Mike Hacker"
            },
            "tags": [
                   "Articles"
            ],
            "date_published": "2023-01-05T10:55:11-05:00",
            "date_modified": "2023-01-10T09:40:33-05:00"
        }
    ]
}
